# Pandas Stacking

Reshaping of a dataframe can be done using `stack()`, `unstack()` and `melt()` methods.

## How to reshape a pandas dataframe using stack, unstack and melt method.

The most common methods for Reshaping a dataframe in pandas are using - 

* Stack method.
* Unstack method.
* Melt method.

Let's create a dataframe.

In [ ]:
# Importing library
import pandas as pd

# Creating DataFrame from Multi-dimensional list
lst = [['Ben','M'],['Gwen','F'],['Kevin','M'],['Julie','F'],['Azmuth','M'],['Vilgax','M'],['Prof. Paradox','M'],['Highbreed Commander','M']]
Cartoon_df = pd.DataFrame(lst, columns = ['Cartoon_Name','Cartoon_Gender'])

Cartoon_df

          Cartoon_Name Cartoon_Gender
0                  Ben              M
1                 Gwen              F
2                Kevin              M
3                Julie              F
4               Azmuth              M
5               Vilgax              M
6        Prof. Paradox              M
7  Highbreed Commander              M

## 1.Reshape by using `stack()` method

Lets see the syntax of stack() method.

### dataframe.stack()

__Purpose:__ This method is mainly used to reshape the dataframe.

__Returns:__ Dataframe with index.

In [ ]:
# Reshape dataframe using stack method
Cartoon_stacked = Cartoon_df.stack()

Cartoon_stacked

0  Cartoon_Name                      Ben
   Cartoon_Gender                      M
1  Cartoon_Name                     Gwen
   Cartoon_Gender                      F
2  Cartoon_Name                    Kevin
   Cartoon_Gender                      M
3  Cartoon_Name                    Julie
   Cartoon_Gender                      F
4  Cartoon_Name                   Azmuth
   Cartoon_Gender                      M
5  Cartoon_Name                   Vilgax
   Cartoon_Gender                      M
6  Cartoon_Name            Prof. Paradox
   Cartoon_Gender                      M
7  Cartoon_Name      Highbreed Commander
   Cartoon_Gender                      M
dtype: object

You can see that Cartoon_df has 7 rows and 2 columns and after applying stack method Cartoon_df has been streched in length and total number of rows are 7*2 = 14 rows.

## 2.Reshape by using `unstack()` method

Lets see the syntax of unstack() method.

### dataframe.unstack()

__Purpose:__ This method is opposite to stack() method, it is mainly used to reshape dataframe.

__Returns:__ DataFrame with new innermost level of column tag.

In [ ]:
# Reshape dataframe using unstack method
Cartoon_unstacked = Cartoon_stacked.unstack()

Cartoon_unstacked

          Cartoon_Name Cartoon_Gender
0                  Ben              M
1                 Gwen              F
2                Kevin              M
3                Julie              F
4               Azmuth              M
5               Vilgax              M
6        Prof. Paradox              M
7  Highbreed Commander              M

You can see that after applying unstack to Cartoon_stacked, you get the original dataframe 'Cartoon_df'.

## 3.Reshape by using `melt()`

Lets see the syntax of melt() method.

### dataframe.melt(id_vars = ['col_names'])

__Purpose:__ This method is also used to reshape the dataframe.

__Returns:__ Reshaped dataframe from width to length format.

In [ ]:
# Reshape dataframe using melt method
Cartoon_melt = Cartoon_df.melt(id_vars = ['Cartoon_Name'])

Cartoon_melt

          Cartoon_Name        variable value
0                  Ben  Cartoon_Gender     M
1                 Gwen  Cartoon_Gender     F
2                Kevin  Cartoon_Gender     M
3                Julie  Cartoon_Gender     F
4               Azmuth  Cartoon_Gender     M
5               Vilgax  Cartoon_Gender     M
6        Prof. Paradox  Cartoon_Gender     M
7  Highbreed Commander  Cartoon_Gender     M

You can see that after applying melt to Cartoon_df, it has splitted the unspecified column 'Cartoon_gender' into variable and value where variable has column name 'Cartoon_gender' and value has its respective data value.

## 4.Practical Tips

* Use different parameters in the melt method and analyze the output.

* Ensure that you have used correct parameters for `melt()`.

## 5.Test Your Knowledge

__Q1.__ reshape() can be used to reshape dataframe in pandas. True or False ?

__Ans.__ `False.` `reshape()` can be used to reshape pandas series but for reshaping pandas dataframe `stack()`, `unstack()` and `melt()` methods are used.



__Q2.__ If all column names are specified as argument in 'id_vars' in `melt()` method it will return the original dataframe as output. True or False ?

__Ans.__ `False.` `melt()` is used for reshaping, if all column names are specified as argument in the melt method value, variable and other column names are displayed with empty dataframe.



__Q3.__ What will be the output of following code ?

In [ ]:
import pandas as pd

l = [['Shinchan',9],['Doraemon',8],['Ninja Hattori',7],['Ben 10',9],['Mickey Mouse',7],['Dragon Ball Z',9]]  

d = pd.DataFrame(l, columns = ['Name','points'])
d_stacked = d.stack()

d_stacked

0  Name           Shinchan
   points                9
1  Name           Doraemon
   points                8
2  Name      Ninja Hattori
   points                7
3  Name             Ben 10
   points                9
4  Name       Mickey Mouse
   points                7
5  Name      Dragon Ball Z
   points                9
dtype: object

__Q4.__ What will be the output of following code ?

In [ ]:
import pandas as pd

l = [['Shinchan',9],['Doraemon',8],['Ninja Hattori',7],['Ben 10',9],['Mickey Mouse',7],['Dragon Ball Z',9]]  

d = pd.DataFrame(l, columns = ['Name','points'])
d_stacked = d.stack()
d_unstacked = d_stacked.unstack()

d_unstacked

            Name points
0       Shinchan      9
1       Doraemon      8
2  Ninja Hattori      7
3         Ben 10      9
4   Mickey Mouse      7
5  Dragon Ball Z      9

__Q5.__ What will be the output of following code ?

In [ ]:
import pandas as pd

l = [['Shinchan',9],['Doraemon',8],['Ninja Hattori',7],['Ben 10',9],['Mickey Mouse',7],['Dragon Ball Z',9]]  

d = pd.DataFrame(l, columns = ['Name','points'])
d_melt = d.melt()

d_melt

   variable          value
0      Name       Shinchan
1      Name       Doraemon
2      Name  Ninja Hattori
3      Name         Ben 10
4      Name   Mickey Mouse
5      Name  Dragon Ball Z
6    points              9
7    points              8
8    points              7
9    points              9
10   points              7
11   points              9